#pragma once

// Satisfactory SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "FG_FactoryGame_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FactoryGame.FGActorRepresentation
// 0x0078 (0x00A0 - 0x0028)
class UFGActorRepresentation : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class AActor*                                      mRealActor;                                               // 0x0030(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FVector_NetQuantize                         mActorLocation;                                           // 0x0038(0x000C) (Net)
	struct FRotator                                    mActorRotation;                                           // 0x0044(0x000C) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mIsStatic;                                                // 0x0050(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	class UTexture2D*                                  mRepresentationTexture;                                   // 0x0058(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FText                                       mRepresentationText;                                      // 0x0060(0x0028) (Net)
	struct FLinearColor                                mRepresentationColor;                                     // 0x0078(0x0010) (Net, ZeroConstructor, IsPlainOldData)
	ERepresentationType                                mRepresentationType;                                      // 0x0088(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	EFogOfWarRevealType                                mFogOfWarRevealType;                                      // 0x0089(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x008A(0x0002) MISSED OFFSET
	float                                              mFogOfWarRevealRadius;                                    // 0x008C(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0090(0x0008) MISSED OFFSET
	bool                                               mShouldShowInCompass;                                     // 0x0098(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mShouldShowOnMap;                                         // 0x0099(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	ECompassViewDistance                               mCompassViewDistance;                                     // 0x009A(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x5];                                       // 0x009B(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentation");
		return ptr;
	}


	void OnRep_ShouldShowOnMap();
	void OnRep_ShouldShowInCompass();
	void OnRep_ActorRepresentationUpdated();
	bool IsActorStatic();
	bool GetShouldShowOnMap();
	bool GetShouldShowInCompass();
	ERepresentationType GetRepresentationType();
	class UTexture2D* GetRepresentationTexture();
	struct FText GetRepresentationText();
	struct FLinearColor GetRepresentationColor();
	class AActor* GetRealActor();
	bool GetIsTemporary();
	EFogOfWarRevealType GetFogOfWarRevealType();
	float GetFogOfWarRevealRadius();
	ECompassViewDistance GetCompassViewDistance();
	struct FRotator GetActorRotation();
	struct FVector GetActorLocation();
};


// Class FactoryGame.FGActorRepresentationInterface
// 0x0000 (0x0028 - 0x0028)
class UFGActorRepresentationInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentationInterface");
		return ptr;
	}


	bool UpdateRepresentation();
	struct FText SetActorRepresentationText(struct FText* newText);
	void SetActorRepresentationColor(struct FLinearColor* NewColor);
	ECompassViewDistance SetActorCompassViewDistance(ECompassViewDistance* compassViewDistance);
	bool RemoveAsRepresentation();
	bool IsActorStatic();
	struct FRotator GetRealActorRotation();
	struct FVector GetRealActorLocation();
	bool GetActorShouldShowOnMap();
	bool GetActorShouldShowInCompass();
	ERepresentationType GetActorRepresentationType();
	class UTexture2D* GetActorRepresentationTexture();
	struct FText GetActorRepresentationText();
	struct FLinearColor GetActorRepresentationColor();
	EFogOfWarRevealType GetActorFogOfWarRevealType();
	float GetActorFogOfWarRevealRadius();
	ECompassViewDistance GetActorCompassViewDistance();
	bool AddAsRepresentation();
};


// Class FactoryGame.FGSubsystem
// 0x0000 (0x0330 - 0x0330)
class AFGSubsystem : public AInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGSubsystem");
		return ptr;
	}

};


// Class FactoryGame.FGActorRepresentationManager
// 0x00A0 (0x03D0 - 0x0330)
class AFGActorRepresentationManager : public AFGSubsystem
{
public:
	struct FScriptMulticastDelegate                    mOnActorRepresentationAdded;                              // 0x0330(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationRemoved;                            // 0x0340(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdated;                            // 0x0350(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdatedCompassShow;                 // 0x0360(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationUpdatedMapShow;                     // 0x0370(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationTypeFilteredOnMap;                  // 0x0380(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnActorRepresentationTypeFilteredOnCompass;              // 0x0390(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class UFGActorRepresentation*>              mReplicatedRepresentations;                               // 0x03A0(0x0010) (Net, ZeroConstructor)
	TArray<class UFGActorRepresentation*>              mClientReplicatedRepresentations;                         // 0x03B0(0x0010) (ZeroConstructor)
	TArray<class UFGActorRepresentation*>              mLocalRepresentations;                                    // 0x03C0(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGActorRepresentationManager");
		return ptr;
	}


	bool UpdateRepresentation(class AActor** realActor, bool* isLocal);
	void SetMapRepresentationTypeFilter(class APawn** owningPlayerPawn, ERepresentationType* Type, bool* visible);
	void SetCompassViewDistanceForActorRepresentation(class UFGActorRepresentation** actorRepresentation, ECompassViewDistance* viewDistance);
	void SetCompassRepresentationTypeFilter(class APawn** owningPlayerPawn, ERepresentationType* Type, bool* visible);
	bool RemoveRepresentationOfActor(class AActor** realActor);
	void OnRep_ReplicatedRepresentations();
	bool GetMapRepresentationTypeFilter(class APawn** owningPlayerPawn, ERepresentationType* Type);
	float GetDistanceValueFromCompassViewDistance(ECompassViewDistance* compassViewDistance);
	bool GetCompassRepresentationTypeFilter(class APawn** owningPlayerPawn, ERepresentationType* Type);
	void GetAllActorRepresentations(TArray<class UFGActorRepresentation*>* out_AllRepresentations);
	class AFGActorRepresentationManager* STATIC_Get(class UObject** WorldContext);
	bool CreateAndAddNewRepresentationNoActor(struct FVector* Location, class UTexture2D** compassTexture, struct FLinearColor* compassColor, float* LifeTime, bool* shouldShowInCompass, bool* shouldShowOnMap, ERepresentationType* representationType, bool* isLocal);
	bool CreateAndAddNewRepresentation(class AActor** realActor, bool* isLocal);
};


// Class FactoryGame.FGAdminInterface
// 0x00F0 (0x0420 - 0x0330)
class AFGAdminInterface : public AInfo
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0330(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAdminInterface");
		return ptr;
	}


	void SetSessionVisibility(TEnumAsByte<ESessionVisibility>* Visibility);
	void Server_SaveGame(int16_t* RequestID, class FString* SaveGame);
	void Server_LoadGame(struct FSaveHeader* Header);
	void Server_EnumerateSaveGames(int16_t* RequestID);
	void Server_DeleteSaveFiles(TArray<class FString>* saveNames, int16_t* RequestID);
	void SaveGame(bool* locally, class FString* saveName, struct FScriptDelegate* completeDelegate);
	void LoadGame(bool* locally, struct FSaveHeader* save);
	void KickPlayer(class APlayerState** PlayerState);
	void EnumerateSaveGames(bool* localSaves, struct FScriptDelegate* completeDelegate);
	void DeleteSaveSession(bool* localSaves, struct FSessionSaveStruct* session, struct FScriptDelegate* completeDelegate);
	void DeleteSaveFiles(bool* localSaves, TArray<class FString>* saveNames, struct FScriptDelegate* completeDelegate);
	void DeleteSaveFile(bool* localSaves, class FString* saveName, struct FScriptDelegate* completeDelegate);
	void Client_OnSaveGameCompleted(bool* success, int16_t* RequestID, struct FText* errorMessage);
	void Client_OnEnumerateSaveGamesCompleted(bool* success, int16_t* RequestID, TArray<struct FSaveHeader>* saves);
	void Client_DeleteSaveFilesCompleted(bool* success, int16_t* RequestID);
};


// Class FactoryGame.FGAggroTargetInterface
// 0x0000 (0x0028 - 0x0028)
class UFGAggroTargetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAggroTargetInterface");
		return ptr;
	}


	void UnregisterAttacker(class AFGEnemyController** forController);
	bool ShouldAutoregisterAsTargetable();
	void RegisterIncomingAttacker(class AFGEnemyController** forController);
	bool IsAlive();
	class UPrimitiveComponent* GetTargetComponent();
	float GetEnemyTargetDesirability(class AFGEnemyController** forController);
	struct FVector GetAttackLocation();
	class AActor* GetActor();
};


// Class FactoryGame.FGAISystem
// 0x00A0 (0x01D0 - 0x0130)
class UFGAISystem : public UAISystem
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0130(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    mOnAggroTargetAdded;                                      // 0x0138(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    mOnAggroTargetRemoved;                                    // 0x0148(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              mDisableAIDistance;                                       // 0x0158(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mNavWalkingDistance;                                      // 0x015C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mMeshTickEnableDistance;                                  // 0x0160(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mMeshUpdateDistance;                                      // 0x0164(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mActivateSpawnerDistance;                                 // 0x0168(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mDisablePawnMovement;                                     // 0x016C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5B];                                      // 0x016D(0x005B) MISSED OFFSET
	int                                                mMaxCreatureIterationsPerTick;                            // 0x01C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                mMaxSpawnerIterationsPerTick;                             // 0x01CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAISystem");
		return ptr;
	}


	void UnpardonActor(class AActor** InActor);
	void STATIC_RemoveFromTargetableList(TScriptInterface<class UFGAggroTargetInterface>* aggroTarget);
	void PlayerDestroyed(class AActor** destroyedPlayer);
	void PardonActor(class AActor** InActor);
	bool IsActorPardoned(class AActor** InActor);
	TArray<TScriptInterface<class UFGAggroTargetInterface>> GetAggroTargetList();
	void CreatureDestroyed(class AActor** destroyedEnemy);
	void ClearAllPardonedActors();
	void AggroTargetDestroyed(class AActor** DestroyedActor);
	void STATIC_AddToTargetableList(TScriptInterface<class UFGAggroTargetInterface>* aggroTarget);
};


// Class FactoryGame.FGAmbientSettings
// 0x0028 (0x0050 - 0x0028)
class UFGAmbientSettings : public UObject
{
public:
	class UAkAudioEvent*                               mOnEnterOuterVolumeEvent;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnExitOuterVolumeEvent;                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnEnterInnerVolumeEvent;                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               mOnExitInnerVolumeEvent;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      mIgnoreListenerRotation : 1;                              // 0x0048(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientSettings");
		return ptr;
	}


	bool ShouldIgnoreListenerRotation();
	void OnExitOuterVolume(class UAkComponent** ambientComponent);
	void OnExitInnerVolume(class UAkComponent** ambientComponent);
	void OnEnterOuterVolume(class UAkComponent** ambientComponent);
	void OnEnterInnerVolume(class UAkComponent** ambientComponent);
	class UAkAudioEvent* GetEnterOuterVolumeEvent();
	class UAkAudioEvent* GetEnterInnerVolumeEvent();
};


// Class FactoryGame.FGAmbientSoundSpline
// 0x0020 (0x0350 - 0x0330)
class AFGAmbientSoundSpline : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0330(0x0008) MISSED OFFSET
	class USplineComponent*                            mSpline;                                                  // 0x0338(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFGSoundSplineComponent*                     mSoundSpline;                                             // 0x0340(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              mSignificanceRange;                                       // 0x0348(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x034C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientSoundSpline");
		return ptr;
	}


	class USplineComponent* GetSplineComponent();
};


// Class FactoryGame.FGAmbientVolume
// 0x0040 (0x03A8 - 0x0368)
class AFGAmbientVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0368(0x0008) MISSED OFFSET
	class UClass*                                      mAmbientSettings;                                         // 0x0370(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UAkComponent*                                mAudioComponent;                                          // 0x0378(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	float                                              mAdditionalAttenuationDistance;                           // 0x0380(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x0384(0x0020) MISSED OFFSET
	float                                              mSignificanceRange;                                       // 0x03A4(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAmbientVolume");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_Attack
// 0x0000 (0x0038 - 0x0038)
class UFGAnimNotify_Attack : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_Attack");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_FootDown
// 0x0008 (0x0040 - 0x0038)
class UFGAnimNotify_FootDown : public UAnimNotify
{
public:
	int                                                mFootIndex;                                               // 0x0038(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mPlaySound;                                               // 0x003C(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_FootDown");
		return ptr;
	}

};


// Class FactoryGame.FGAnimNotify_Landed
// 0x0000 (0x0038 - 0x0038)
class UFGAnimNotify_Landed : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimNotify_Landed");
		return ptr;
	}

};


// Class FactoryGame.FGCharacterAnimInstance
// 0x0120 (0x0390 - 0x0270)
class UFGCharacterAnimInstance : public UAnimInstance
{
public:
	struct FVector                                     mVelocity;                                                // 0x0270(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mVelocityLocalNormalized;                                 // 0x027C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mAccelerationLocalNormalized;                             // 0x0288(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0294(0x000C) MISSED OFFSET
	struct FTransform                                  mActorTransform;                                          // 0x02A0(0x0030) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	class AFGCharacterBase*                            mCachedCharacter;                                         // 0x02D0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         mCachedMovementMode;                                      // 0x02D8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EMovementMode>                         mCachedDefaultWalkMode;                                   // 0x02D9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x02DA(0x0002) MISSED OFFSET
	float                                              mSpeed;                                                   // 0x02DC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mSpeedLastFrame;                                          // 0x02E0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mSpeedZ;                                                  // 0x02E4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mWalkRotation;                                            // 0x02E8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mIsStandingStill;                                         // 0x02EC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mIsAccelerating;                                          // 0x02ED(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x02EE(0x0002) MISSED OFFSET
	float                                              mYawDelta;                                                // 0x02F0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYaw;                                                  // 0x02F4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawInterpSpeed;                                       // 0x02F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    mRootRotation;                                            // 0x02FC(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceLeft;                                         // 0x0308(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceRight;                                        // 0x0309(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mTurnInPlaceComplete;                                     // 0x030A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x5];                                       // 0x030B(0x0005) MISSED OFFSET
	class UCurveFloat*                                 mTurnLeftCurve;                                           // 0x0310(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 mTurnRightCurve;                                          // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     mActorRotationForwardVector;                              // 0x0320(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     mActorRotationForwardVectorReference;                     // 0x032C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawReductionStartTime;                                // 0x0338(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimYawReductionCurrentTime;                              // 0x033C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    mActorRotationLastTick;                                   // 0x0340(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mYawRotationStrength;                                     // 0x034C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mYawRotationInterpSpeed;                                  // 0x0350(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mRootRotationInterpSpeed;                                 // 0x0354(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mAllowedToTurn;                                           // 0x0358(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0359(0x0007) MISSED OFFSET
	float                                              mTurnInPlaceDefaultTime;                                  // 0x0360(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mUseTurnInPlace;                                          // 0x0364(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mCanUpdateActorRotationReference;                         // 0x0365(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x0366(0x0002) MISSED OFFSET
	float                                              mYawAimMaxValue;                                          // 0x0368(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mYawAimMinValue;                                          // 0x036C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mAimPitch;                                                // 0x0370(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              mAimPitchInterpSpeed;                                     // 0x0374(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mGetDeltaPitchRotation;                                   // 0x0378(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mUsePreLand;                                              // 0x0379(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mPreLand;                                                 // 0x037A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x037B(0x0001) MISSED OFFSET
	float                                              mPreLandVelocityMultiplier;                               // 0x037C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<TEnumAsByte<ECollisionChannel>>             mPreLandCollisionChannels;                                // 0x0380(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGCharacterAnimInstance");
		return ptr;
	}


	void OnRadialDamageTaken();
	void OnPointDamageTaken(struct FVector* shootDIrection);
	void OnAnyDamageTaken();
	float GetVelocityDirection();
	struct FVector GetVelocity();
	struct FRotator GetDesiredWalkRotation();
	struct FRotator GetDesiredRunLeanRotation();
	class AFGCharacterBase* GetCachedCharacter();
	float GetAccelerationVectorLength();
};


// Class FactoryGame.FGAnimPlayer
// 0x0010 (0x03A0 - 0x0390)
class UFGAnimPlayer : public UFGCharacterAnimInstance
{
public:
	bool                                               mIsFirstPerson;                                           // 0x0390(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EArmEquipment                                      mArmSlotType;                                             // 0x0391(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBackEquipment                                     mBacklotType;                                             // 0x0392(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0393(0x0005) MISSED OFFSET
	class AFGCharacterPlayer*                          mCharacter;                                               // 0x0398(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnimPlayer");
		return ptr;
	}

};


// Class FactoryGame.FGItemDescriptor
// 0x0120 (0x0148 - 0x0028)
class UFGItemDescriptor : public UObject
{
public:
	bool                                               mUseDisplayNameAndDescription;                            // 0x0028(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FText                                       mDisplayName;                                             // 0x0030(0x0028) (Edit, DisableEditOnInstance)
	struct FText                                       mDescription;                                             // 0x0048(0x0028) (Edit, DisableEditOnInstance)
	EStackSize                                         mStackSize;                                               // 0x0060(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mCanBeDiscarded;                                          // 0x0061(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               mRememberPickUp;                                          // 0x0062(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0063(0x0001) MISSED OFFSET
	float                                              mEnergyValue;                                             // 0x0064(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mRadioactiveDecay;                                        // 0x0068(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                mResourceSinkPoints;                                      // 0x006C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EResourceForm                                      mForm;                                                    // 0x0070(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	struct FSlateBrush                                 mInventoryIcon;                                           // 0x0078(0x0088)
	class UTexture2D*                                  mSmallIcon;                                               // 0x0100(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  mPersistentBigIcon;                                       // 0x0108(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMesh*                                 mConveyorMesh;                                            // 0x0110(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FItemView                                   mPreviewView;                                             // 0x0118(0x0014) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData03[0x4];                                       // 0x012C(0x0004) MISSED OFFSET
	class UClass*                                      mItemCategory;                                            // 0x0130(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mFluidDensity;                                            // 0x0138(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mFluidViscosity;                                          // 0x013C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              mFluidFriction;                                           // 0x0140(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FColor                                      mFluidColor;                                              // 0x0144(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGItemDescriptor");
		return ptr;
	}


	bool STATIC_RememberPickUp(class UClass** inClass);
	float STATIC_GetStackSizeConverted(class UClass** inClass);
	int STATIC_GetStackSize(class UClass** inClass);
	class UTexture2D* STATIC_GetSmallIcon(class UClass** inClass);
	float STATIC_GetRadioactiveDecay(class UClass** inClass);
	void STATIC_GetPreviewView(class UClass** inClass, struct FItemView* out_previewView);
	struct FText STATIC_GetItemName(class UClass** inClass);
	class UStaticMesh* STATIC_GetItemMesh(class UClass** inClass);
	struct FSlateBrush STATIC_GetItemIcon(class UClass** inClass);
	struct FText STATIC_GetItemDescription(class UClass** inClass);
	class UClass* STATIC_GetItemCategory(class UClass** inClass);
	void STATIC_GetIconView(class UClass** inClass, struct FItemView* out_itemView);
	EResourceForm STATIC_GetForm(class UClass** inClass);
	float STATIC_GetFluidViscosity(class UClass** inClass);
	float STATIC_GetFluidFriction(class UClass** inClass);
	float STATIC_GetFluidDensity(class UClass** inClass);
	struct FLinearColor STATIC_GetFluidColorLinear(class UClass** inClass);
	struct FColor STATIC_GetFluidColor(class UClass** inClass);
	float STATIC_GetEnergyValue(class UClass** inClass);
	class UTexture2D* STATIC_GetBigIcon(class UClass** inClass);
	bool STATIC_CanBeDiscarded(class UClass** inClass);
};


// Class FactoryGame.FGAnyUndefinedDescriptor
// 0x0000 (0x0148 - 0x0148)
class UFGAnyUndefinedDescriptor : public UFGItemDescriptor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAnyUndefinedDescriptor");
		return ptr;
	}

};


// Class FactoryGame.FGAssetManager
// 0x0000 (0x0428 - 0x0428)
class UFGAssetManager : public UAssetManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAssetManager");
		return ptr;
	}

};


// Class FactoryGame.FGAtmosphereUpdater
// 0x0010 (0x0038 - 0x0028)
class UFGAtmosphereUpdater : public UObject
{
public:
	TArray<class UWorld*>                              mActiveWorlds;                                            // 0x0028(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAtmosphereUpdater");
		return ptr;
	}

};


// Class FactoryGame.FGAtmosphereVolume
// 0x5118 (0x5480 - 0x0368)
class AFGAtmosphereVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0368(0x0010) MISSED OFFSET
	float                                              mPriority;                                                // 0x0378(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              mBlendDistance;                                           // 0x037C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FRuntimeFloatCurve                          mFogHeight;                                               // 0x0380(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFogDensity;                                              // 0x0408(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mFogInscatteringColor;                                    // 0x0490(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFullyDirectionalInscatteringColorDistance;               // 0x0698(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mNonDirectionalInscatteringColorDistance;                 // 0x0720(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mDirectionalInscatteringExponent;                         // 0x07A8(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mDirectionalInscatteringStartDistance;                    // 0x0830(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mDirectionalInscatteringColor;                            // 0x08B8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFogHeightFalloff;                                        // 0x0AC0(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFogMaxOpacity;                                           // 0x0B48(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mStartDistance;                                           // 0x0BD0(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFogCutoffDistance;                                       // 0x0C58(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mHorizonColorCurve;                                       // 0x0CE0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mZenithColorCurve;                                        // 0x0EE8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mCloudColorCurve;                                         // 0x10F0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mSunLightColorCurve;                                      // 0x12F8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mMoonLightColorCurve;                                     // 0x1500(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mSunIntensity;                                            // 0x1708(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mMoonIntensity;                                           // 0x1790(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mCloudOpacity;                                            // 0x1818(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              mBlendWeight;                                             // 0x18A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x18A4(0x0004) MISSED OFFSET
	struct FRuntimeFloatCurve                          mWhiteTemp;                                               // 0x18A8(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mWhiteTint;                                               // 0x1930(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorSaturation;                                         // 0x19B8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorContrast;                                           // 0x1BC0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGamma;                                              // 0x1DC8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGain;                                               // 0x1FD0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorOffset;                                             // 0x21D8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorSaturationShadows;                                  // 0x23E0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorContrastShadows;                                    // 0x25E8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGammaShadows;                                       // 0x27F0(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGainShadows;                                        // 0x29F8(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorOffsetShadows;                                      // 0x2C00(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorSaturationMidtones;                                 // 0x2E08(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorContrastMidtones;                                   // 0x3010(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGammaMidtones;                                      // 0x3218(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGainMidtones;                                       // 0x3420(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorOffsetMidtones;                                     // 0x3628(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorSaturationHighlights;                               // 0x3830(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorContrastHighlights;                                 // 0x3A38(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGammaHighlights;                                    // 0x3C40(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorGainHighlights;                                     // 0x3E48(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mColorOffsetHighlights;                                   // 0x4050(0x0208) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mColorCorrectionHighlightsMin;                            // 0x4258(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mColorCorrectionShadowsMax;                               // 0x42E0(0x0088) (Edit)
	struct FRuntimeFloatCurve                          mBlueCorrection;                                          // 0x4368(0x0088) (Edit)
	struct FRuntimeFloatCurve                          mExpandGamut;                                             // 0x43F0(0x0088) (Edit)
	struct FRuntimeCurveLinearColor                    mSceneColorTint;                                          // 0x4478(0x0208) (Edit)
	struct FRuntimeFloatCurve                          mFilmSlope;                                               // 0x4680(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFilmToe;                                                 // 0x4708(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFilmShoulder;                                            // 0x4790(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFilmBlackClip;                                           // 0x4818(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeFloatCurve                          mFilmWhiteClip;                                           // 0x48A0(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FRuntimeCurveLinearColor                    mContrast;                                                // 0x4928(0x0208) (Deprecated)
	struct FRuntimeCurveLinearColor                    mGain;                                                    // 0x4B30(0x0208) (Deprecated)
	struct FRuntimeCurveLinearColor                    mSaturation;                                              // 0x4D38(0x0208) (Deprecated)
	unsigned char                                      mEnableContrast : 1;                                      // 0x4F40(0x0001) (Deprecated)
	unsigned char                                      mEnableGain : 1;                                          // 0x4F40(0x0001) (Deprecated)
	unsigned char                                      mEnableSaturation : 1;                                    // 0x4F40(0x0001) (Deprecated)
	unsigned char                                      mEnableFogHeight : 1;                                     // 0x4F40(0x0001) (Edit)
	unsigned char                                      mEnableFogDensity : 1;                                    // 0x4F40(0x0001) (Edit)
	unsigned char                                      mEnableFogInscatteringColor : 1;                          // 0x4F40(0x0001) (Edit)
	unsigned char                                      mEnableFullyDirectionalInscatteringColorDistance : 1;     // 0x4F40(0x0001) (Edit)
	unsigned char                                      mEnableNonDirectionalInscatteringColorDistance : 1;       // 0x4F40(0x0001) (Edit)
	unsigned char                                      mEnableDirectionalInscatteringExponent : 1;               // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableDirectionalInscatteringStartDistance : 1;          // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableDirectionalInscatteringColor : 1;                  // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableFogHeightFalloff : 1;                              // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableFogMaxOpacity : 1;                                 // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableStartDistance : 1;                                 // 0x4F41(0x0001) (Edit)
	unsigned char                                      mEnableFogCutoffDistance : 1;                             // 0x4F41(0x0001) (Edit)
	unsigned char                                      mOverrideHorizonColor : 1;                                // 0x4F41(0x0001) (Edit)
	unsigned char                                      mOverrideMoonIntensity : 1;                               // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideCloudOpacity : 1;                                // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideSunIntensity : 1;                                // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideZenithColor : 1;                                 // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideCloudColor : 1;                                  // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideSunLightColor : 1;                               // 0x4F42(0x0001) (Edit)
	unsigned char                                      mOverrideMoonLightColor : 1;                              // 0x4F42(0x0001) (Edit)
	unsigned char                                      mEnableWhiteTemp : 1;                                     // 0x4F42(0x0001) (Edit)
	unsigned char                                      mEnableWhiteTint : 1;                                     // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableColorSaturation : 1;                               // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableColorContrast : 1;                                 // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableColorGamma : 1;                                    // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableColorGain : 1;                                     // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableColorOffset : 1;                                   // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableFilmSlope : 1;                                     // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableFilmToe : 1;                                       // 0x4F43(0x0001) (Edit)
	unsigned char                                      mEnableFilmShoulder : 1;                                  // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableFilmBlackClip : 1;                                 // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableFilmWhiteClip : 1;                                 // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorSaturationShadows : 1;                        // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorContrastShadows : 1;                          // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorGammaShadows : 1;                             // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorGainShadows : 1;                              // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorOffsetShadows : 1;                            // 0x4F44(0x0001) (Edit)
	unsigned char                                      mEnableColorSaturationMidtones : 1;                       // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorContrastMidtones : 1;                         // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorGammaMidtones : 1;                            // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorGainMidtones : 1;                             // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorOffsetMidtones : 1;                           // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorSaturationHighlights : 1;                     // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorContrastHighlights : 1;                       // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorGammaHighlights : 1;                          // 0x4F45(0x0001) (Edit)
	unsigned char                                      mEnableColorGainHighlights : 1;                           // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableColorOffsetHighlights : 1;                         // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableColorCorrectionShadowsMax : 1;                     // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableColorCorrectionHighlightsMin : 1;                  // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableBlueCorrection : 1;                                // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableExpandGamut : 1;                                   // 0x4F46(0x0001) (Edit)
	unsigned char                                      mEnableSceneColorTint : 1;                                // 0x4F46(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x539];                                     // 0x4F47(0x0539) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGAtmosphereVolume");
		return ptr;
	}

};


// Class FactoryGame.FGHologram
// 0x00C0 (0x03F0 - 0x0330)
class AFGHologram : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0330(0x0010) MISSED OFFSET
	TArray<class UClass*>                              mValidHitClasses;                                         // 0x0340(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst)
	class UClass*                                      mRecipe;                                                  // 0x0350(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	class UAkComponent*                                mLoopSound;                                               // 0x0358(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBoxComponent*                               mClearanceDetector;                                       // 0x0360(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0xD];                                       // 0x0368(0x000D) MISSED OFFSET
	bool                                               mPlacementMaterial;                                       // 0x0375(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0376(0x0002) MISSED OFFSET
	class UMaterialInstance*                           mValidPlacementMaterial;                                  // 0x0378(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           mInvalidPlacementMaterial;                                // 0x0380(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class AFGHologram*>                         mChildren;                                                // 0x0388(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0398(0x0008) MISSED OFFSET
	class UClass*                                      mBuildClass;                                              // 0x03A0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mUseBuildClearanceOverlapSnapp;                           // 0x03A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x17];                                      // 0x03A9(0x0017) MISSED OFFSET
	class APawn*                                       mConstructionInstigator;                                  // 0x03C0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               mIsDisabled;                                              // 0x03C8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               mIsChanged;                                               // 0x03C9(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x03CA(0x0002) MISSED OFFSET
	int                                                mInitialScrollModeValue;                                  // 0x03CC(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x03D0(0x0004) MISSED OFFSET
	struct FVector                                     mConstructionPosition;                                    // 0x03D4(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FRotator                                    mConstructionRotation;                                    // 0x03E0(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x03EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FactoryGame.FGHologram");
		return ptr;
	}


	class AFGHologram* STATIC_SpawnHologramFromRecipe(class UClass** inRecipe, class AActor** hologramOwner, struct FVector* SpawnLocation, class APawn** hologramInstigator);
